# Quality of dev life
brew 'bash' # Latest bash version
brew 'bat'
brew 'cloc'
brew 'diff-so-fancy'
brew 'direnv'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'fx' # nicer JSON output
brew 'fzf' # Fuzzy finder
brew 'gh'
brew 'git'
brew 'gpg'
brew 'jq'
brew 'ripgrep'
brew 'starship'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tree'
brew 'watch'
brew 'wget'

# Dev tool specific
brew 'chruby'
brew 'docker'
brew 'go'
brew 'golangci-lint'
brew 'grpcurl'
brew 'istioctl'
brew 'jetbrains-toolbox'
brew 'jenv' # Java env manager
brew 'neovim'
brew 'pre-commit'
brew 'ruby'
brew 'shfmt'
brew 'shellcheck'

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"

# Extra
brew 'asciinema'
brew 'speedtest-cli'

# GUI apps
cask '1password'
cask 'alfred'
cask 'dropbox'
cask 'docker'
cask 'evernote'
cask 'sublime-text'
cask 'firefox'
cask 'flycut'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'meetingbar'
cask 'monodraw'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'

# Mac App Store apps
brew 'mas' # Mac App Store manager
mas 'Kindle', id: 405399194