# Quality of dev life
brew 'bash' # latest bash version
brew 'bat' # better cat
brew 'broot' # better tree
brew 'cloc' # code counter
brew 'diff-so-fancy'
brew 'direnv'
brew 'exa' # better ls
brew 'fasd'
brew 'fd'
brew 'fx' # nicer JSON output
brew 'fzf' # fuzzy finder
brew 'gh'
brew 'git'
brew 'git-delta' # better git diffs
brew 'gpg'
brew 'imagemagick'
brew 'jq'
brew 'pre-commit'
brew 'ripgrep' # better grep
brew 'starship'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tree'
brew 'watch'
brew 'wget'

# Dev tool specific
brew 'buf'
brew 'chruby'
brew 'docker'
brew 'go'
brew 'golangci-lint'
brew 'grpcurl'
brew 'istioctl'
brew 'jetbrains-toolbox'
brew 'jenv' # Java env manager
brew 'neovim'
brew 'pre-commit'
brew 'protobuf'
brew 'ruby'
brew 'rustup'
brew 'shfmt'
brew 'shellcheck'

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"

tap "superfly/tap"
brew "superfly/tap/flyctl"

# Extra
brew 'asciinema'

# GUI apps
cask '1password'
cask 'alfred'
cask 'burp-suite'
cask 'charles'
cask 'dropbox'
cask 'docker'
cask 'evernote'
cask 'sublime-text'
cask 'stretchly'
cask 'figma'
cask 'firefox'
cask 'flycut'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'inkscape'
cask 'iterm2'
cask 'meetingbar'
cask 'monodraw'
cask 'ngrok'
cask 'proxyman'
cask 'rectangle' # window resizer
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'

# Mac App Store apps
brew 'mas' # Mac App Store manager
mas 'Kindle', id: 405399194