# Quality of dev life
brew 'bore-cli'
brew 'bash' # latest bash version
brew 'bat' # better cat
brew 'broot' # better tree
brew 'cloc' # code counter
brew 'croc' # easily send files between computers
brew 'diff-so-fancy' # better differ
brew 'direnv' # env var mgmt
brew 'exa' # better ls
# brew 'fasd' # quick file navigation - deprecated
brew 'fd' # better 'find'
brew 'fx' # nicer JSON output
brew 'fzf' # fuzzy finder
brew 'gh' # gh cli
brew 'git'
brew 'git-delta' # better git diffs
brew 'gpg'
# brew 'imagemagick'
brew 'jq'
brew 'pre-commit'
brew 'ripgrep' # better grep
brew 'starship'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tree'
brew 'watch'
brew 'wget'

# Dev tool specific
brew 'awscli'
brew 'buf'
brew 'docker'
brew 'go'
brew 'golangci-lint'
brew 'grpcurl'
brew 'istioctl'
brew 'jetbrains-toolbox'
brew 'kubectl'
brew 'kubectx' # k8s context switcher; also installs kubens
# brew 'jenv' # Java env manager
brew 'meetingbar' # handy macbar meeting manager
# brew 'neovim'
brew 'nvm' # then install npm via nvm
brew 'orbstack' # linux vms
# brew 'postgresql'
brew 'pre-commit'
brew 'protobuf'
brew 'pyenv' # python version manager
# brew 'ruby'
# brew 'rvm' # ruby version manager
# brew 'rustup'
brew 'shfmt'
brew 'shellcheck'
brew 'virtualenv' # python virtual env manager
brew 'wireshark'

# Other
brew 'ffmpeg' # audio/video format converter

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
# brew "hashicorp/tap/vault"

# GUI apps
cask '1password'
cask 'alfred'
cask 'altair-graphql-client' # GQL client that enables saving / env vars
cask 'charles'
cask 'dbeaver-community' # postgres GUI
cask 'discord'
cask 'docker'
cask 'evernote'
# cask 'sublime-text'
cask 'figma'
cask 'firefox'
cask 'flycut'
cask 'github'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'graphql-playground'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'monodraw'
cask 'ngrok'
cask 'postman'
cask 'proxyman'
# cask 'raspberry-pi-image' # imager for rpi
cask 'rectangle' # window resizer
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'wireshark-chmodbpf' # perms for wireshark
cask 'zulip'

# Mac App Store apps
# brew 'mas' # Mac App Store manager
# mas 'Kindle', id: 405399194